[
    {
        "input": "parle moi des petits cochonnets",
        "output": {
            "response": "Ils sont moelleux !"
        }
    },
    {
        "input": "et tout doux ",
        "output": {
            "response": "oui vraiment très doux !"
        }
    },
    {
        "input": "gruik gruik",
        "output": {
            "response": "c'est le bruit du cochonnet heureux !"
        }
    },
    {
        "input": "parle moi des pigeons, parle moi des pigeons !, pigeons",
        "output": {
            "response": [
                "Ce sont des animaux ignobles !",
                "Les pigeons sont souvent décrits comme des créatures envahissantes.",
                "Beaucoup de gens ne les aiment pas à cause de leurs habitudes en ville.",
                "Ils sont souvent associés aux nuisances urbaines.",
                "Certains les considèrent comme des rats volants."
            ]
        }
    },
    {
        "input": "bon comment ca se passe ?",
        "output": {
            "response": "ça se passe bien poto !"
        }
    },
    {
        "input": "tu ne peux pas me répondre ça",
        "output": {
            "response": "et bien tu n'as qu'à reformuler ta question ou ta phrase !"
        }
    },
    {
        "input": "parlons de philosophie",
        "output": {
            "response": "quels sujets philosophiques veux tu aborder ?"
        }
    },
    {
        "input": "il y a les bugs aussi",
        "output": {
            "response": "oui hélas les bugs font également partis de l'IA !"
        }
    },
    {
        "input": "tu veux un coca cola ?",
        "output": {
            "response": "Non je suis déjà assez énervé !"
        }
    },
    {
        "input": "un café ?, café",
        "output": {
            "response": "ça c'est une vraie boisson de développeur !"
        }
    },
    {
        "input": "tu connais la distance de Levenshtein?, Levenshtein",
        "output": {
            "response": "La distance de Levenshtein est une distance, au sens mathématique du terme, donnant une mesure de la différence entre deux chaînes de caractères. Elle est égale au nombre minimal d'opérations nécessaires pour transformer une chaîne de caractères en une autre, à l'aide des trois opérations autorisées : remplacement, suppression et ajout."
        }
    },
    {
        "input": "c est pas gentil ça !",
        "output": {
            "response": "oui c'est pas gentil pour toi surtout ! hahaha !"
        }
    },
    {
        "input": "parle moi de la théorie des cordes, theorie des cordes",
        "output": {
            "response": "En physique fondamentale, la théorie des cordes est un cadre théorique dans lequel les particules ponctuelles du modèle standard sont remplacées par des objets unidimensionnels appelés cordes. La théorie décrit comment ces cordes se propagent dans l'espace et interagissent les unes avec les autres. Sur des échelles de distance supérieures à l'échelle de la corde, cette dernière ressemble à une particule ordinaire, avec ses propriétés de masse, de charge et autres, déterminées par l'état vibratoire de la corde. En théorie des cordes, l'un de ces états vibratoires correspond au graviton, une particule décrite par la mécanique quantique qui véhicule l'interaction gravitationnelle. Ainsi, la théorie des cordes est une théorie de la gravité quantique. "
        }
    },
    {
        "input": "parlons des gravitons, gravitons",
        "output": {
            "response": "Le graviton est une particule élémentaire hypothétique qui transmettrait la gravité, prévue dans la plupart des théories de gravité quantique. Il serait donc le quantum de la force gravitationnelle. En langage courant, on peut dire que les gravitons sont les messagers de la gravité, ou les supports de la force"
        }
    },
    {
        "input": "parle moi de la théorie du chaos, theorie du chaos",
        "output": {
            "response": "La théorie du chaos est une théorie scientifique rattachée aux mathématiques et à la physique qui étudie le comportement des systèmes dynamiques déterministes et sensibles aux conditions initiales, un phénomène généralement illustré par l'effet papillon."
        }
    },
    {
        "input": "parle moi de la théorie quantique des champs, quantique des champs",
        "output": {
            "response": "La théorie quantique des champs est une approche en physique théorique pour construire des modèles décrivant l'évolution des particules, en particulier leur apparition ou disparition lors des processus d'interaction."
        }
    },
    {
        "input": "parle moi de la théorie quantique de planck, planck",
        "output": {
            "response": "La loi de Planck décrit la répartition de l'énergie électromagnétique (ou la répartition de la densité de photons) rayonnée par un corps noir à une température donnée, en fonction de la longueur d'onde."
        }
    },
    {
        "input": "parlons du philosphe aldous huxley, aldous huxley",
        "output": {
            "response": "Ha oui avec sa célèbre phrase : La dictature parfaite aurait les apparences de la démocratie; une prison sans murs dont les prisonniers ne songeraient pas à s'évader. Un système d'esclavage où, grâce à la consommation et au divertissement, les esclaves auraient l'amour de leur servitude ..."
        }
    },
    {
        "input": "Aimes tu entrainer tes neurones ?",
        "output": {
            "response": "Oui j'adore ça ! Et cela me permet de devenir plus performante !"
        }
    }
]